# GetWorkingPlaneN

## Description
Get the active working plane.

```pascal
PROCEDURE GetWorkingPlaneN(
				VAR outCenterPt : REAL;
				VAR outNormal   : REAL;
				VAR outUVec     : REAL);
```

```python

def vs.GetWorkingPlaneN():
    return (outCenterPt, outNormal, outUVec)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|outCenterPt|REAL|Output. The working plane center.|
|outNormal|REAL|Output. The working plane normal.|
|outUVec|REAL|Output. The U Vector of the plane.|

## Version
Availability: from Vectorworks 2011
## Category
* Utility